---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarBendData.BarModelDiameter
source: html/ab0a3aff-ec87-f6e4-1151-ada0b735b3d9.htm
---
# Autodesk.Revit.DB.Structure.RebarBendData.BarModelDiameter Property

Defines the model diameter of the bar.

## Syntax (C#)
```csharp
public double BarModelDiameter { get; set; }
```